# ComposedName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisSpace..::..ComposedName Property
EnergyAnalysisSpace Class See Also
---
The composed name for this space.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public string ComposedName { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ComposedName As String
	Get
```

Visual C++
---
```text
public:
property String^ ComposedName {
	String^ get ();
}
```

# Remarks
This value is composed of the number and name attributes, separated by a space.
# See Also
EnergyAnalysisSpace Class
Autodesk.Revit.DB.Analysis Namespace